app/controllers/application_controller.rb

INSERT INTO "spree_stores" ("name", "url", "meta_description", "meta_keywords", "seo_title", "mail_from_address", "default_currency", "code", "default", "created_at", "updated_at", "supported_currencies", "facebook", "twitter", "instagram", "default_locale", "customer_support_email", "default_country_id", "description", "address", "contact_phone", "new_order_notifications_email", "checkout_zone_id", "seo_robots", "supported_locales", "deleted_at", "settings", "preferences", "public_metadata", "private_metadata", "storefront_custom_code_head", "storefront_custom_code_body_start", "storefront_custom_code_body_end") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33) RETURNING "id"
---
  def find_or_create_retail_store
    Spree::Store.find_or_create_by(code: 'retail') do |store|