app/controllers/home_controller.rb

  def index
    @featured_products = Product.active.limit(6)
---
SELECT "products".* FROM "products" WHERE "products"."active" = $1 LIMIT $2  [["active", true], ["LIMIT", 6]]