app/controllers/products_controller.rb

SELECT 1 AS one FROM "products" WHERE "products"."active" = $1 LIMIT $2  [["active", true], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."active" = $1 LIMIT $2  [["active", true], ["LIMIT", 20]]
---
  def index
    @products = Product.active
    @products = @products.by_supplier(params[:supplier]) if params[:supplier].present?
    @products = @products.where("name ILIKE ?", "%#{params[:search]}%") if params[:search].present?
    @products = @products.limit(20) # Simple limit for now

INSERT INTO "customizations" ("user_id", "product_id", "design_data", "ai_estimation", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def save_customization
    @customization = current_user.customizations.build(customization_params)
    @customization.product = @product

    if @customization.save

INSERT INTO "customizations" ("user_id", "product_id", "design_data", "ai_estimation", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def save_customization
    if user_signed_in?
      @customization = current_user.customizations.build(customization_params)
      @customization.product = @product

      if @customization.save

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_product
    @product = Product.find(params[:id])